doublemarkpro/HomeworkTimer-ESP32-S3-Touch-LCD-3.49/sdkconfig.defaults
# ESP32-S3-Touch-LCD-3.49B / ESP-IDF defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 8 MB OPI PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_FREERTOS_HZ=1000

# LVGL 9
CONFIG_LV_OS_FREERTOS=y
# GCC 15 reports conflicting per-function IRAM sections in LVGL 9.3.
# The regular flash implementation is fast enough for this UI.
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"

# esp_codec_dev uses the ESP-IDF 6.x I2C master driver.
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n
